14790897/ESP32-Vlog-Camera/src/app_httpd.cpp
    <div class="container">
        <!-- 视频流卡片 -->
        <div class="card">
            <div class="card-header">
                <div class="card-title">实时预览</div>
                <div id="status" class="status status-stopped">准备就绪</div>
            </div>
            <div class="stream-container">
                <canvas id="stream-canvas" width="640" height="480" style="width:100%;"></canvas>
                <div class="stream-overlay" id="fps-display">30 FPS</div>
                <div id="stream-status" class="stream-status"></div>
            </div>
            <div class="stats" id="stats">
                <div class="stat-item">分辨率: <span id="resolution">HD</span></div>
                <div class="stat-item">质量: <span id="quality">高</span></div>
            </div>
        </div>

        <!-- 录制控制卡片 -->
        <div class="card">
            <div class="card-header">
                <div class="card-title">录制控制</div>
            </div>
            <div class="controls">
                <button id="startBtn" class="btn btn-success">开始录制</button>
                <button id="stopBtn" class="btn btn-danger">停止录制</button>
            </div>

            <!-- 录制信息显示区 -->
            <div id="recording-info" class="recording-info" style="display: none; margin-top: 20px; padding-top: 15px; border-top: 1px solid #eee;">
                <h3 style="font-size: 1.1rem; margin-bottom: 10px;">当前录制信息</h3>
                <div class="recording-stats">
                    <div class="stat-row">
                        <span class="stat-label">文件名：</span>
                        <span id="rec-filename" class="stat-value">-</span>
                    </div>
                    <div class="stat-row">
                        <span class="stat-label">录制时长：</span>
                        <span id="rec-duration" class="stat-value">00:00:00</span>
                    </div>
                    <div class="stat-row">
                        <span class="stat-label">文件大小：</span>
                        <span id="rec-size" class="stat-value">0 KB</span>
                    </div>
                    <div class="stat-row">
                        <span class="stat-label">帧数：</span>
                        <span id="rec-frames" class="stat-value">0</span>
                    </div>
                    <div class="stat-row">
                        <span class="stat-label">实时帧率：</span>
                        <span id="rec-fps" class="stat-value">0 FPS</span>
                    </div>
                </div>
            </div>
        </div>

        <!-- 设置卡片 -->
        <div class="card">
            <div class="card-header">
                <div class="card-title">相机设置</div>
            </div>
            <div class="settings-grid">
                <div class="setting-item">
                    <div class="setting-label">
                        <span>帧率 (FPS)</span>
                        <span class="setting-value" id="fps-value">30</span>
                    </div>
                    <input type="range" min="5" max="60" value="30" class="slider" id="fps-slider">
                </div>

                <div class="setting-item">
                    <div class="setting-label">
                        <span>陀螺仪数据</span>
                    </div>
                    <label class="toggle-switch">
                        <input type="checkbox" id="mpu-toggle">
                        <span class="toggle-slider"></span>
                    </label>
                </div>
            </div>
        </div>
    </div>

    <div id="notification" class="notification"></div>

    <script>
        // DOM元素
        const statusEl = document.getElementById('status');
        const startBtn = document.getElementById('startBtn');
        const stopBtn = document.getElementById('stopBtn');
        const fpsSlider = document.getElementById('fps-slider');
        const fpsValue = document.getElementById('fps-value');
        const fpsDisplay = document.getElementById('fps-display');
        const mpuToggle = document.getElementById('mpu-toggle');
        const notificationEl = document.getElementById('notification');
        const streamCanvas = document.getElementById('stream-canvas');
        const streamStatus = document.getElementById('stream-status');

        // 录制信息元素
        const recordingInfoEl = document.getElementById('recording-info');
        const recFilenameEl = document.getElementById('rec-filename');
        const recDurationEl = document.getElementById('rec-duration');
        const recSizeEl = document.getElementById('rec-size');
        const recFramesEl = document.getElementById('rec-frames');
        const recFpsEl = document.getElementById('rec-fps');

        // 流媒体变量
        let streamActive = false;
        let mjpegStream = null;
        let lastFrameTime = 0;
        let frameCount = 0;
        let streamFps = 0;
        let streamInterval = null;

        // 初始化Canvas
        const ctx = streamCanvas.getContext('2d');

        // 设置Canvas尺寸为容器宽度
        function resizeCanvas() {
            const container = streamCanvas.parentElement;
            const containerWidth = container.clientWidth;
            // 保持原始宽高比 (4:3)
            const aspectRatio = 4/3;
            const canvasHeight = containerWidth / aspectRatio;

            // 设置画布尺寸
            streamCanvas.width = containerWidth;
            streamCanvas.height = canvasHeight;

            // 重绘初始内容
            drawInitialCanvas();
        }

        // 绘制初始内容
        function drawInitialCanvas() {
            ctx.fillStyle = '#f0f0f0';
            ctx.fillRect(0, 0, streamCanvas.width, streamCanvas.height);
            ctx.fillStyle = '#666';
            ctx.font = '20px Arial';
            ctx.textAlign = 'center';
            ctx.textBaseline = 'middle';
            ctx.fillText('点击开始流媒体', streamCanvas.width / 2, streamCanvas.height / 2);
        }

        // 初始调整尺寸
        resizeCanvas();

        // 当窗口大小变化时调整Canvas尺寸
        window.addEventListener('resize', resizeCanvas);

        // 显示流媒体状态
        function showStreamStatus(message, isError = false) {
            if (message) {
                streamStatus.textContent = message;
                streamStatus.style.display = 'block';
                streamStatus.style.backgroundColor = isError ? 'rgba(220, 53, 69, 0.7)' : 'rgba(0, 0, 0, 0.7)';
            } else {
                streamStatus.style.display = 'none';
            }
        }

        // 启动流媒体
        function startStream() {
            // 检查是否正在录制
            if (statusEl.textContent === '正在录制') {
                showStreamStatus('无法在录制时播放流媒体', true);
                showNotification('无法在录制时流媒体播放', 5000);
                return;
            }

