14790897/ESP32-Vlog-Camera/src/app_httpd.cpp
            if (streamActive) return;

            showStreamStatus('正在连接...');

            // 创建新的Image对象用于加载MJPEG流
            const img = new Image();
            img.onload = function() {
                // 第一帧加载成功，隐藏状态消息
                showStreamStatus(null);
                streamActive = true;
            };

            img.onerror = function() {
                showStreamStatus('流媒体加载失败', true);
                showNotification('流媒体加载失败', 5000);
                stopStream();
            };

            // 使用时间戳防止缓存
            img.src = '/stream?t=' + new Date().getTime();
            mjpegStream = img;

            // 设置定时器来更新Canvas
            streamInterval = setInterval(updateCanvas, 30); // 约33fps的更新率

            // 计算FPS
            setInterval(calculateStreamFps, 1000);
        }

        // 停止流媒体
        function stopStream() {
            if (!streamActive) return;

            clearInterval(streamInterval);
            streamActive = false;
            mjpegStream = null;

            // 重置Canvas
            drawInitialCanvas();

            showNotification('流媒体已停止');
        }

        // 更新Canvas
        function updateCanvas() {
            if (!streamActive || !mjpegStream) return;

            try {
                // 清除画布
                ctx.clearRect(0, 0, streamCanvas.width, streamCanvas.height);

                // 计算维持宽高比的绘制尺寸
                const imgWidth = mjpegStream.naturalWidth || 640;
                const imgHeight = mjpegStream.naturalHeight || 480;
                const imgAspect = imgWidth / imgHeight;
                const canvasAspect = streamCanvas.width / streamCanvas.height;

                let drawWidth, drawHeight, offsetX = 0, offsetY = 0;

                if (imgAspect > canvasAspect) {
                    // 图像更宽，适应高度
                    drawWidth = streamCanvas.width;
                    drawHeight = drawWidth / imgAspect;
                    offsetY = (streamCanvas.height - drawHeight) / 2;
                } else {
                    // 图像更高，适应宽度
                    drawHeight = streamCanvas.height;
                    drawWidth = drawHeight * imgAspect;
                    offsetX = (streamCanvas.width - drawWidth) / 2;
                }

                // 绘制图像
                ctx.drawImage(mjpegStream, offsetX, offsetY, drawWidth, drawHeight);
                frameCount++;
                lastFrameTime = performance.now();
            } catch (e) {
                console.error('Canvas更新错误:', e);
                console.error(e);
            }
        }

        // 计算流媒体FPS
        function calculateStreamFps() {
            if (!streamActive) {
                streamFps = 0;
                return;
            }

            streamFps = frameCount;
            frameCount = 0;
            fpsDisplay.textContent = `${streamFps} FPS`;
        }

        // 点击Canvas开始/停止流媒体
        streamCanvas.addEventListener('click', function() {
            if (streamActive) {
                stopStream();
            } else {
                startStream();
            }
        });

        // 显示通知
        function showNotification(message, duration = 3000) {
            notificationEl.textContent = message;
            notificationEl.classList.add('show');

            setTimeout(() => {
                notificationEl.classList.remove('show');
            }, duration);
        }

        // 格式化时间为 HH:MM:SS
        function formatTime(seconds) {
            const hrs = Math.floor(seconds / 3600);
            const mins = Math.floor((seconds % 3600) / 60);
            const secs = Math.floor(seconds % 60);
            return `${hrs.toString().padStart(2, '0')}:${mins.toString().padStart(2, '0')}:${secs.toString().padStart(2, '0')}`;
        }

        // 获取录制统计信息
        async function fetchRecordingStats() {
            try {
                const response = await fetch('/recording_stats');
                const data = await response.json();

                if (data.recording) {
                    // 显示录制信息区域
                    recordingInfoEl.style.display = 'block';

                    // 更新各项统计信息
                    recFilenameEl.textContent = data.filename || '-';
                    recDurationEl.textContent = formatTime(data.duration);
                    recSizeEl.textContent = data.size;
                    recFramesEl.textContent = data.frames;
                    recFpsEl.textContent = `${data.fps.toFixed(1)} FPS`;
                } else {
                    // 隐藏录制信息区域
                    recordingInfoEl.style.display = 'none';
                }
            } catch (error) {
                console.error('Error fetching recording stats:', error);
            }
        }

        // 更新录制状态
        async function updateStatus() {
            try {
                const response = await fetch('/record');
                const statusText = await response.text();

                if (statusText.includes('Recording')) {
                    statusEl.textContent = '正在录制';
                    statusEl.className = 'status status-recording';
                    startBtn.disabled = true;
                    stopBtn.disabled = false;

                    // 如果流媒体正在播放，停止它
                    if (streamActive) {
                        stopStream();
                        showStreamStatus('录制进行中，无法播放流媒体', true);
                    }

                    // 获取录制统计信息
                    await fetchRecordingStats();
                } else {
                    statusEl.textContent = '准备就绪';
                    statusEl.className = 'status status-stopped';
                    startBtn.disabled = false;
                    stopBtn.disabled = true;
                    recordingInfoEl.style.display = 'none';
                }
            } catch (error) {
                console.error('Error checking status:', error);
            }
        }

        // 开始录制
        async function startRecording() {
            try {
                // 如果流媒体正在播放，停止它
                if (streamActive) {
                    stopStream();
                    showStreamStatus('录制进行中，无法播放流媒体', true);
                }

