14790897/ESP32-Vlog-Camera/src/app_httpd.cpp
                const response = await fetch('/record?action=start');
                const result = await response.text();

                if (result.includes('started')) {
                    showNotification('录制已开始');
                } else if (result.includes('streaming')) {
                    showNotification('无法在流媒体播放时录制', 5000);
                } else {
                    showNotification(result);
                }

                updateStatus();
            } catch (error) {
                showNotification('开始录制失败');
                console.error('Error starting recording:', error);
            }
        }

        // 停止录制
        async function stopRecording() {
            try {
                const response = await fetch('/record?action=stop');
                const result = await response.text();
                showNotification(result.includes('stopped') ? '录制已停止' : result);
                updateStatus();
            } catch (error) {
                showNotification('停止录制失败');
                console.error('Error stopping recording:', error);
            }
        }

        // 设置FPS
        async function setFPS(fps) {
            fpsValue.textContent = fps;
            fpsDisplay.textContent = `${fps} FPS`;

            try {
                const response = await fetch(`/fps?value=${fps}`);
                const result = await response.text();
                if (result.includes('updated')) {
                    showNotification(`帧率已设置为 ${fps} FPS`);
                }
            } catch (error) {
                showNotification('设置帧率失败');
                console.error('Error setting FPS:', error);
            }
        }

        // 切换MPU状态
        async function toggleMPU(enabled) {
            try {
                const response = await fetch(`/mpu_toggle?enable=${enabled ? 1 : 0}`);
                const result = await response.text();
                showNotification(enabled ? '陀螺仪数据已启用' : '陀螺仪数据已禁用');
            } catch (error) {
                showNotification('切换陀螺仪状态失败');
                console.error('Error toggling MPU:', error);
            }
        }

        // 获取当前FPS
        async function getCurrentFPS() {
            try {
                const response = await fetch('/fps');
                const result = await response.text();
                const fpsMatch = result.match(/\d+/);
                if (fpsMatch) {
                    const currentFps = fpsMatch[0];
                    fpsSlider.value = currentFps;
                    fpsValue.textContent = currentFps;
                    fpsDisplay.textContent = `${currentFps} FPS`;
                }
            } catch (error) {
                console.error('Error getting current FPS:', error);
            }
        }

        // 获取MPU状态
        async function getMPUStatus() {
            try {
                const response = await fetch('/mpu_toggle');
                const result = await response.text();
                mpuToggle.checked = result.includes('ON');
            } catch (error) {
                console.error('Error getting MPU status:', error);
            }
        }

        // 事件监听器
        startBtn.addEventListener('click', startRecording);
        stopBtn.addEventListener('click', stopRecording);

        fpsSlider.addEventListener('input', function() {
            fpsValue.textContent = this.value;
        });

        fpsSlider.addEventListener('change', function() {
            setFPS(this.value);
        });

        mpuToggle.addEventListener('change', function() {
            toggleMPU(this.checked);
        });

        // 初始化
        window.addEventListener('load', async function() {
            await updateStatus();
            await getCurrentFPS();
            await getMPUStatus();

            // 如果没有录制，自动启动流媒体
            if (statusEl.textContent !== '正在录制') {
                // 稍微延迟启动流媒体，确保其他初始化完成
                setTimeout(startStream, 500);
            }
        });

        // 定期更新状态
        setInterval(updateStatus, 5000);

        // 当录制时，更频繁地更新录制统计信息
        setInterval(async () => {
            if (statusEl.textContent === '正在录制') {
                await fetchRecordingStats();
            }
        }, 1000);
    </script>
</body>
</html>
)rawliteral";

static ra_filter_t *ra_filter_init(ra_filter_t *filter, size_t sample_size)
{
    memset(filter, 0, sizeof(ra_filter_t));

    filter->values = (int *)malloc(sample_size * sizeof(int));
    if (!filter->values)
    {
        return NULL;
    }
    memset(filter->values, 0, sample_size * sizeof(int));

    filter->size = sample_size;
    return filter;
}

#if ARDUHAL_LOG_LEVEL >= ARDUHAL_LOG_LEVEL_INFO
static int ra_filter_run(ra_filter_t *filter, int value)
{
    if (!filter->values)
    {
        return value;
    }
    filter->sum -= filter->values[filter->index];
    filter->values[filter->index] = value;
    filter->sum += filter->values[filter->index];
    filter->index++;
    filter->index = filter->index % filter->size;
    if (filter->count < filter->size)
    {
        filter->count++;
    }
    return filter->sum / filter->count;
}
#endif

#if CONFIG_LED_ILLUMINATOR_ENABLED
void enable_led(bool en)
{ // Turn LED On or Off
    int duty = en ? led_duty : 0;
    if (en && isStreaming && (led_duty > CONFIG_LED_MAX_INTENSITY))
    {
        duty = CONFIG_LED_MAX_INTENSITY;
    }
    ledcWrite(LED_LEDC_GPIO, duty);
    Serial.printf("[I] Set LED intensity to %d\n", duty);
}
#endif

// Redirect ESP-IDF log output to Arduino Serial
extern "C" {
    #include "esp_log.h"
}
static int arduino_log_write_v(const char *fmt, va_list args) {
    char buf[256];
    int len = vsnprintf(buf, sizeof(buf), fmt, args);
    if (len > 0) {
        Serial.print(buf);
    }
    return len;
}
static void redirect_esp_log_to_serial() {
    esp_log_set_vprintf([](const char *fmt, va_list args) -> int {
        return arduino_log_write_v(fmt, args);
    });
}

// Initialize SD card
static bool initSDCard()
{
    // Check if PSRAM is enabled and available
    if(psramFound()) {
        Serial.printf("[I] PSRAM is enabled, size: %d MB\n", ESP.getPsramSize() / (1024 * 1024));
    } else {
        Serial.printf("[W] PSRAM is not initialized! Recording performance may be limited\n");
    }

    SD_MMC.setPins(SD_MMC_CLK, SD_MMC_CMD, SD_MMC_D0);

    if (!SD_MMC.begin("/sdcard", true))
    { // Use 1-bit mode for compatibility
        Serial.printf("[E] SD Card Mount Failed\n");
        return false;
    }

