14790897/ESP32-Vlog-Camera/src/app_httpd.cpp
    // NTP time sync initialization
    if (!sntp_enabled()) {
        sntp_setoperatingmode(SNTP_OPMODE_POLL);
        sntp_setservername(0, (char*)"ntp.aliyun.com");
        sntp_setservername(1, (char*)"pool.ntp.org");
        sntp_init();
    }

    // Wait for time to be set (max 5s)
    time_t now = 0;
    struct tm timeinfo = { 0 };
    int retry = 0;
    const int retry_count = 10;
    while (timeinfo.tm_year < (2016 - 1900) && ++retry < retry_count) {
        Serial.printf("[I] Waiting for system time to be set... (%d/%d)\n", retry, retry_count);
        vTaskDelay(500 / portTICK_PERIOD_MS);
        time(&now);
        localtime_r(&now, &timeinfo);
    }

    // Initialize SD Card
    if (!initSDCard())
    {
        Serial.printf("[E] Failed to initialize SD card - recording will be disabled\n");
    }

    httpd_config_t config = HTTPD_DEFAULT_CONFIG();
    config.max_uri_handlers = 16;

    // Add index handler for the root path
    httpd_uri_t index_uri = {
        .uri       = "/",
        .method    = HTTP_GET,
        .handler   = index_handler,
        .user_ctx  = NULL
    };

    httpd_uri_t xclk_uri = {
        .uri = "/xclk",
        .method = HTTP_GET,
        .handler = xclk_handler,
        .user_ctx = NULL
#ifdef CONFIG_HTTPD_WS_SUPPORT
        ,
        .is_websocket = true,
        .handle_ws_control_frames = false,
        .supported_subprotocol = NULL
#endif
    };

    httpd_uri_t record_uri = {
        .uri = "/record",
        .method = HTTP_GET,
        .handler = record_handler,
        .user_ctx = NULL
#ifdef CONFIG_HTTPD_WS_SUPPORT
        ,
        .is_websocket = false, // Changed to false since this is not a websocket endpoint
        .handle_ws_control_frames = false,
        .supported_subprotocol = NULL
#endif
    };

    httpd_uri_t mpu_toggle_uri = {
        .uri = "/mpu_toggle",
        .method = HTTP_GET,
        .handler = mpu_toggle_handler,
        .user_ctx = NULL
    };

    httpd_uri_t fps_uri = {
        .uri = "/fps",
        .method = HTTP_GET,
        .handler = fps_handler,
        .user_ctx = NULL
    };

    httpd_uri_t stats_uri = {
        .uri = "/recording_stats",
        .method = HTTP_GET,
        .handler = recording_stats_handler,
        .user_ctx = NULL
    };

    httpd_uri_t stream_uri = {
        .uri = "/stream",
        .method = HTTP_GET,
        .handler = stream_handler,
        .user_ctx = NULL};

    ra_filter_init(&ra_filter, 20);

    // Set initial FPS
    setTargetFPS(30); // Default to 30 FPS

    Serial.printf("[I] Starting web server on port: '%d'\n", config.server_port);
    if (httpd_start(&camera_httpd, &config) == ESP_OK)
    {
        httpd_register_uri_handler(camera_httpd, &index_uri);  // Register index handler
        httpd_register_uri_handler(camera_httpd, &xclk_uri);
        httpd_register_uri_handler(camera_httpd, &record_uri); // Register record handler
        httpd_register_uri_handler(camera_httpd, &mpu_toggle_uri); // Register MPU control handler
        httpd_register_uri_handler(camera_httpd, &fps_uri); // Register FPS control handler
        httpd_register_uri_handler(camera_httpd, &stats_uri); // Register recording stats handler
        httpd_register_uri_handler(camera_httpd, &stream_uri); // Register stream handler
        Serial.printf("[I] Camera server started successfully\n");
    } else {
        Serial.printf("[E] Failed to start camera server\n");
    }

}

// Function to set the target FPS
void setTargetFPS(int fps) {
    if (fps < 1) fps = 1; // Prevent division by zero
    if (fps > 60) fps = 60; // Cap at 60 FPS to be reasonable

    targetFPS = fps;
    minFrameTimeMs = 1000 / targetFPS;
    Serial.printf("[I] Target FPS set to %d (frame interval: %d ms)\n", targetFPS, minFrameTimeMs);
}

void setupLedFlash(int pin)
{
#if CONFIG_LED_ILLUMINATOR_ENABLED
    // Modern PWM configuration for ESP32-S3
    // Using LEDC channel 8 with 10-bit resolution and 5kHz frequency
    ledcSetup(8, 5000, 10); // channel 8, 5kHz, 10-bit resolution (0-1023)
    ledcAttachPin(pin, 8);  // attach the pin to channel 8
    // Initialize with LED off
    ledcWrite(8, 0);
#else
    Serial.printf("[I] LED flash is disabled -> CONFIG_LED_ILLUMINATOR_ENABLED = 0\n");
#endif
}